# SQL for Analyst 1

## 0. Connect to MySQL Server

In [1]:
# set MySQL URL
user = "dz3vg"
password = ""
host = "localhost"
port = 3306
dbname = "dataapplab_db"
with open("MySQL.key", "r") as file:
    password = file.read()
connection_string = f"mysql+mysqlconnector://{user}:{password}@{host}:{port}/{dbname}"

# connect to MySQL server
%load_ext sql
%sql $connection_string

# clean password
password = ""
connection_string = ""

## 1. MySQL Show Commands

In [2]:
%sql select version(), current_date;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[('8.0.21-0ubuntu0.20.04.4', datetime.date(2020, 8, 7))]

In [3]:
%sql select 5 + 3, sin(pi()/4), (4+1)*5;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(8, 0.7071067811865475, 25)]

In [4]:
%sql show databases;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[('dalba',),
 ('dataapplab_db',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

In [5]:
%sql show tables;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [6]:
%sql drop database if exists dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[]

In [7]:
%sql create database if not exists dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[]

In [8]:
%sql use dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [9]:
%%sql

drop table if exists products;

create table products (
    primary key (product_id), 
    product_id int(11) not null auto_increment, 
    product_name varchar(100) default null, 
    image_url varchar(255) default null, 
    sales_status enum('NEW','DEPRECATED') default 'NEW', 
    price  decimal(9,2) default null, 
    create_date datetime)
;

describe products;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
6 rows affected.

[('product_id', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('product_name', b'varchar(100)', 'YES', '', None, ''),
 ('image_url', b'varchar(255)', 'YES', '', None, ''),
 ('sales_status', b"enum('NEW','DEPRECATED')", 'YES', '', b'NEW', ''),
 ('price', b'decimal(9,2)', 'YES', '', None, ''),
 ('create_date', b'datetime', 'YES', '', None, '')]

In [10]:
%%sql

insert into products
values
    (1,'XiangLaJiTuiBaoRenQiCanA','http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg','NEW',36,'2014-11-20 08:20:00'),
    (2,'HaiTaiYanShaoDaJiTuiFanTaoCanA2','','NEW',37,'2014-12-20 08:20:00'),
    (3,'XiaRiBinFenTong','','NEW',88,'2016-11-20 10:20:00'),
    (4,'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB','','NEW',36,'2016-11-20 10:20:00'),
    (5,'GuoQiTaoCan','','DEPRECATED',999,'2018-11-20 10:20:00')
;

select * from products;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.
5 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [11]:
%%sql

insert into products
    (product_name,price,create_date)
values
    ('ChaoJiTaKeWuCanTaoCan',27,now())
;

select * from products;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [12]:
%%sql

drop table if exists orders;

create table orders (
    primary key (order_id),
    order_id int(11) not null auto_increment,
    order_no varchar(100) default null,
    user_name varchar(100) not null,
    product_name varchar(100) not null,
    order_status enum('CART','DRAFT','NEW','IN_PROCESS','COMPLETED','FAILED') default 'CART', 
    create_date datetime not null default current_timestamp comment 'ZhuCeShiJian'
);

describe orders;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
6 rows affected.

[('order_id', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('order_no', b'varchar(100)', 'YES', '', None, ''),
 ('user_name', b'varchar(100)', 'NO', '', None, ''),
 ('product_name', b'varchar(100)', 'NO', '', None, ''),
 ('order_status', b"enum('CART','DRAFT','NEW','IN_PROCESS','COMPLETED','FAILED')", 'YES', '', b'CART', ''),
 ('create_date', b'datetime', 'NO', '', b'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED')]

In [13]:
%%sql

alter table orders add column unit_price decimal(9,2) null default 0.0 after product_name;
alter table orders add column quantity int not null default 0 after unit_price;

describe orders;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
8 rows affected.

[('order_id', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('order_no', b'varchar(100)', 'YES', '', None, ''),
 ('user_name', b'varchar(100)', 'NO', '', None, ''),
 ('product_name', b'varchar(100)', 'NO', '', None, ''),
 ('unit_price', b'decimal(9,2)', 'YES', '', b'0.00', ''),
 ('quantity', b'int', 'NO', '', b'0', ''),
 ('order_status', b"enum('CART','DRAFT','NEW','IN_PROCESS','COMPLETED','FAILED')", 'YES', '', b'CART', ''),
 ('create_date', b'datetime', 'NO', '', b'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED')]

In [14]:
%%sql

insert into orders
    (order_no,user_name,product_name,unit_price,quantity)
values
    ('KFC123','joshua','XiangLaJiTuiBaoRenQiCanA',36,1), 
    ('KFC321','joshua','HaiTaiYanShaoDaJiTuiFanTaoCanA2',37,2), 
    ('KFC234','jane','XiaRiBinFenTong',88,1), 
    ('KFC567','peize','ChaoZhiQuanJiaTong',85,3), 
    ('KFC890','feng','XinAoErLiangKaoJiTuiBaoRenQiTaoCanB',36,2), 
    ('KFC890','xiaowan','ChaoJiTaKeWuCanTaoCan',29,1)
;

select * from orders;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.
6 rows affected.

[(1, 'KFC123', 'joshua', 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00'), 1, 'CART', datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (2, 'KFC321', 'joshua', 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), 2, 'CART', datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (3, 'KFC234', 'jane', 'XiaRiBinFenTong', Decimal('88.00'), 1, 'CART', datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (4, 'KFC567', 'peize', 'ChaoZhiQuanJiaTong', Decimal('85.00'), 3, 'CART', datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (5, 'KFC890', 'feng', 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), 2, 'CART', datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (6, 'KFC890', 'xiaowan', 'ChaoJiTaKeWuCanTaoCan', Decimal('29.00'), 1, 'CART', datetime.datetime(2020, 8, 7, 3, 41, 7))]

## 2. MySQL Query Commands

In [15]:
%%sql

select
    *
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [16]:
%%sql

select
    product_name, price as unit_price
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[('XiangLaJiTuiBaoRenQiCanA', Decimal('36.00')),
 ('HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00')),
 ('XiaRiBinFenTong', Decimal('88.00')),
 ('XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00')),
 ('GuoQiTaoCan', Decimal('999.00')),
 ('ChaoJiTaKeWuCanTaoCan', Decimal('27.00'))]

In [17]:
%%sql

select
    distinct sales_status
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[('NEW',), ('DEPRECATED',)]

In [18]:
%%sql

select
    product_id, product_name, price
from
    products
limit 4
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
4 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00')),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00')),
 (3, 'XiaRiBinFenTong', Decimal('88.00')),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'))]

In [19]:
%%sql

select
    product_id, product_name, price, now() as created_time
from
    products
limit 6
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00'), datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (3, 'XiaRiBinFenTong', Decimal('88.00'), datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (5, 'GuoQiTaoCan', Decimal('999.00'), datetime.datetime(2020, 8, 7, 3, 41, 7)),
 (6, 'ChaoJiTaKeWuCanTaoCan', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [20]:
%%sql

select
    *
from
    products
limit 3
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [21]:
%%sql

select
    *
from
    products
limit 3, 1
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [22]:
%%sql

select
    *
from
    products
limit 3, 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [23]:
%%sql

select
    *
from
    products
limit 3, 3
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [24]:
%%sql

select
    price
from
    products
order by price
limit 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(Decimal('27.00'),), (Decimal('36.00'),)]

In [25]:
%%sql

select
    *
from
    products
order by create_date, price
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [26]:
%%sql

select
    *
from
    products
where
    product_id = 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20))]

In [27]:
%%sql

select
    *
from
    products
where
    product_name = 'ChaoJiTaKeWuCanTaoCan'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [28]:
%%sql

select
    *
from
    products
where
    product_name like 'ChaoJiTa%'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [29]:
%%sql

select
    *
from
    products
where
    product_name like '%TaKe%'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [30]:
%%sql

select
    *
from
    products
where
    product_name <> 'ChaoJiTaKeWuCanTaoCan'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [31]:
%%sql

select
    *
from
    products
where
    product_name not like '%TaKe%'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [32]:
%%sql

select
    *
from
    products
where
    price > 60
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [33]:
%%sql

select
    *
from
    products
where
    price between 30 and 40
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [34]:
%%sql

select
    *
from
    products
where
    price in (88, 27)
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [35]:
%%sql

select
    *
from
    products
where
    price = 88 or price = 27
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [36]:
%%sql

select
    *
from
    products
where
    create_date > "2016-06-20" and sales_status = "NEW"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [37]:
%%sql

select
    *
from
    products
where
    create_date > "2016-06-20" and sales_status <> "NEW"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [38]:
%%sql

select
    *
from
    products
where
    image_url is null
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7))]

In [39]:
%%sql

select
    *
from
    products
where
    image_url is not null
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [40]:
%%sql

select
    *
from
    products
where
    product_name like "Xiang__JiTuiBao%"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20))]

In [41]:
%%sql

select
    *
from
    products
where
    product_name like "XiangLa%"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20))]

In [42]:
%%sql

select
    *
from
    products
where
    product_name like "%Tong"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [43]:
%%sql

select
    *
from
    products
where
    product_name like "_______________"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [44]:
%%sql

select
    product_name, price, 
    price+10 as adjusted_price
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[('XiangLaJiTuiBaoRenQiCanA', Decimal('36.00'), Decimal('46.00')),
 ('HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), Decimal('47.00')),
 ('XiaRiBinFenTong', Decimal('88.00'), Decimal('98.00')),
 ('XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), Decimal('46.00')),
 ('GuoQiTaoCan', Decimal('999.00'), Decimal('1009.00')),
 ('ChaoJiTaKeWuCanTaoCan', Decimal('27.00'), Decimal('37.00'))]

In [45]:
%%sql

select
    *, 
    if(image_url is null, 'missing', image_url)
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20), 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg'),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20), ''),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20), ''),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20), ''),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20), ''),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7), 'missing')]

In [46]:
%%sql

select
    *, 
    (case
        when image_url is null then "missing"
        when image_url = "" then "missing"
        else image_url
    end) as url
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20), 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg'),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20), 'missing'),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20), 'missing'),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20), 'missing'),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20), 'missing'),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7), 'missing')]

In [47]:
%%sql

select
    *, 
    (case
        when price < 20 then "0-20"
        when price >= 20 and price < 30 then "20-30"
        when price >= 30 and price < 40 then "30-40"
        when price >= 40 and price < 50 then "40-50"
        else "price+"
    end) as price_group
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20), '30-40'),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20), '30-40'),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20), 'price+'),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20), '30-40'),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20), 'price+'),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 7, 3, 41, 7), '20-30')]

Note: Command Order

1. select ... condition
2. from ...
3. where condition
4. order by ...
5. limit ...

In [48]:
%%sql

select
    *
from
    products
where
    product_id > 2
order by product_id
limit 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [49]:
%%sql

select *
from
    (select
        product_id, product_name, price
    from
        products) as new_products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00')),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00')),
 (3, 'XiaRiBinFenTong', Decimal('88.00')),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00')),
 (5, 'GuoQiTaoCan', Decimal('999.00')),
 (6, 'ChaoJiTaKeWuCanTaoCan', Decimal('27.00'))]

## 3. MySQL Aggregation Commands

In [50]:
%%sql

select
    count(product_id), 
    count(distinct product_id), 
    count(distinct price), 
    count(distinct sales_status)
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 6, 5, 2)]

In [51]:
%%sql

select
    min(price) as min_msrp, 
    max(price) as max_msrp, 
    sum(price) as total_msrp, 
    count(product_id) as num_products
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(Decimal('27.00'), Decimal('999.00'), Decimal('1223.00'), 6)]

In [52]:
%%sql

select
    any_value(product_name), 
    sales_status, 
    count(distinct product_id), 
    sum(price)
from
    products
group by sales_status
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[('XiangLaJiTuiBaoRenQiCanA', 'NEW', 5, Decimal('224.00')),
 ('GuoQiTaoCan', 'DEPRECATED', 1, Decimal('999.00'))]

In [53]:
%%sql

select
    group_concat(distinct product_name separator " ~~~ "), 
    sales_status, 
    count(distinct product_id), 
    sum(price) 
from
    products
group by sales_status
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[('ChaoJiTaKeWuCanTaoCan ~~~ HaiTaiYanShaoDaJiTuiFanTaoCanA2 ~~~ XiangLaJiTuiBaoRenQiCanA ~~~ XiaRiBinFenTong ~~~ XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', 'NEW', 5, Decimal('224.00')),
 ('GuoQiTaoCan', 'DEPRECATED', 1, Decimal('999.00'))]

In [54]:
%%sql

select
    sales_status, 
    price, 
    group_concat(distinct product_name 
                 order by price asc 
                 separator " >>> ") as product_names, 
    count(*)
from
    products
group by sales_status, price
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[('NEW', Decimal('27.00'), 'ChaoJiTaKeWuCanTaoCan', 1),
 ('NEW', Decimal('36.00'), 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB >>> XiangLaJiTuiBaoRenQiCanA', 2),
 ('NEW', Decimal('37.00'), 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', 1),
 ('NEW', Decimal('88.00'), 'XiaRiBinFenTong', 1),
 ('DEPRECATED', Decimal('999.00'), 'GuoQiTaoCan', 1)]

In [55]:
%%sql

select
    create_date, 
    sum(price)
from
    products
group by create_date
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(datetime.datetime(2014, 11, 20, 8, 20), Decimal('36.00')),
 (datetime.datetime(2014, 12, 20, 8, 20), Decimal('37.00')),
 (datetime.datetime(2016, 11, 20, 10, 20), Decimal('124.00')),
 (datetime.datetime(2018, 11, 20, 10, 20), Decimal('999.00')),
 (datetime.datetime(2020, 8, 7, 3, 41, 7), Decimal('27.00'))]